STMicroelectronics/fp-sns-allmems1/Projects/STM32F446ME-BlueCoin/Applications/ALLMEMS1/STM32F446ME-BlueCoin_ALLMEMS1.ioc
#MicroXplorer Configuration settings - do not modify
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_3
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,master,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,NbrOfConversionFlag
ADC1.NbrOfConversionFlag=1
ADC1.Rank-0\#ChannelRegularConversion=1
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_3CYCLES
ADC1.master=1
File.Version=6
GPIO.groupedBy=Group By Peripherals
I2S2.ClockSource-Half_Duplex_Master=I2S_CLOCK_PLLR
I2S2.ErrorAudioFreq=0.0 %
I2S2.FullDuplexMode=I2S_FULLDUPLEXMODE_DISABLE
I2S2.IPParameters=Instance,VirtualMode,FullDuplexMode,RealAudioFreq,ErrorAudioFreq,ClockSource-Half_Duplex_Master
I2S2.Instance=SPI$Index
I2S2.RealAudioFreq=8.0 KHz
I2S2.VirtualMode=I2S_MODE_MASTER
IWDG.IPParameters=Prescaler,Reload
IWDG.Prescaler=IWDG_PRESCALER_128
IWDG.Reload=300
KeepUserPlacement=false
Mcu.Family=STM32F4
Mcu.IP0=ADC1
Mcu.IP1=CRC
Mcu.IP10=TIM1
Mcu.IP11=TIM4
Mcu.IP12=TIM6
Mcu.IP13=TIM7
Mcu.IP2=I2C1
Mcu.IP3=I2S2
Mcu.IP4=IWDG
Mcu.IP5=NVIC
Mcu.IP6=RCC
Mcu.IP7=SAI1
Mcu.IP8=SPI1
Mcu.IP9=SYS
Mcu.IPNb=14
Mcu.Name=STM32F446M(C-E)Yx
Mcu.Package=WLCSP81
Mcu.Pin0=PE4
Mcu.Pin1=PD6
Mcu.Pin10=PA5
Mcu.Pin11=PC3
Mcu.Pin12=PH1-OSC_OUT
Mcu.Pin13=PA6
Mcu.Pin14=PA1
Mcu.Pin15=PB10
Mcu.Pin16=PE10
Mcu.Pin17=PC4
Mcu.Pin18=PA0-WKUP
Mcu.Pin19=VP_CRC_VS_CRC
Mcu.Pin2=PB4
Mcu.Pin20=VP_IWDG_VS_IWDG
Mcu.Pin21=VP_SYS_VS_Systick
Mcu.Pin22=VP_TIM1_VS_no_output1
Mcu.Pin23=VP_TIM1_VS_no_output3
Mcu.Pin24=VP_TIM1_VS_no_output4
Mcu.Pin25=VP_TIM4_VS_ClockSourceINT
Mcu.Pin26=VP_TIM6_VS_ClockSourceINT
Mcu.Pin27=VP_TIM7_VS_ClockSourceINT
Mcu.Pin28=VP_STMicroelectronics.X-CUBE-BLE1_VS_WirelessJjBlueNRGAaMS_6.2.2
Mcu.Pin29=VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjAccMag_5.4.1_9.1.0
Mcu.Pin3=PB8
Mcu.Pin30=VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjPressTemp_5.3.1_9.1.0
Mcu.Pin4=PB9
Mcu.Pin5=PA7
Mcu.Pin6=PA3
Mcu.Pin7=PA2
Mcu.Pin8=PH0-OSC_IN
Mcu.Pin9=PC7
Mcu.PinsNb=31
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-BLE1.6.2.2
Mcu.ThirdParty1=STMicroelectronics.X-CUBE-MEMS1.9.1.0
Mcu.ThirdPartyNb=2
Mcu.UserConstants=TIM_CLOCK_ENV,2000U;ALGO_FREQ_AR,16U;FREQ_ACC_GYRO_MAG,20U;DEFAULT_uhCCR1_Val,(10000U / ALGO_FREQ_FX);ALGO_FREQ_ENV,2U;ALGO_FREQ_FX,100U;DEFAULT_uhCCR4_Val,(10000U / FREQ_ACC_GYRO_MAG);DEFAULT_uhCCR3_Val,(10000U / ALGO_FREQ_AR);ALGO_FREQ_AUDIO_LEVEL,20U;TIM_CLOCK_AUDIO_LEVEL,10000U
Mcu.UserName=STM32F446MEYx
MxCube.Version=6.4.0
MxDb.Version=DB.6.0.40
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.EXTI0_IRQn=true\:8\:0\:true\:false\:true\:true\:true
NVIC.EXTI15_10_IRQn=true\:3\:0\:true\:false\:true\:true\:true
NVIC.EXTI4_IRQn=true\:8\:0\:true\:false\:true\:true\:true
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.PVD_IRQn=true\:0\:0\:false\:false\:true\:true\:true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true
NVIC.TIM1_CC_IRQn=true\:9\:0\:true\:false\:true\:true\:true
NVIC.TIM4_IRQn=true\:9\:0\:true\:false\:true\:true\:true
NVIC.TIM6_DAC_IRQn=true\:9\:0\:true\:false\:true\:true\:true
NVIC.TIM7_IRQn=true\:15\:0\:true\:false\:true\:true\:true
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA0-WKUP.GPIOParameters=GPIO_Label
PA0-WKUP.GPIO_Label=BSP_LSM6DSM_INT1
PA0-WKUP.Locked=true
PA0-WKUP.Signal=GPXTI0
PA1.Locked=true
PA1.Signal=GPIO_Output
PA2.Locked=true
PA2.Signal=GPIO_Output
PA3.Signal=ADCx_IN3
PA5.Locked=true
PA5.Mode=Full_Duplex_Master
PA5.Signal=SPI1_SCK
PA6.Locked=true
PA6.Mode=Full_Duplex_Master
PA6.Signal=SPI1_MISO
PA7.Locked=true
PA7.Mode=Full_Duplex_Master
PA7.Signal=SPI1_MOSI
PB10.Mode=SAI_A_Master
PB10.Signal=SAI1_SCK_A
PB4.Mode=Half_Duplex_Master
PB4.Signal=I2S2_WS
PB8.Locked=true
PB8.Mode=I2C
PB8.Signal=I2C1_SCL
PB9.Locked=true
PB9.Mode=I2C
PB9.Signal=I2C1_SDA
PC3.Mode=Half_Duplex_Master
PC3.Signal=I2S2_SD
PC4.GPIOParameters=GPIO_Label,GPIO_ModeDefaultEXTI
PC4.GPIO_Label=BSP_LSM6DSM_INT2
PC4.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_RISING
PC4.Locked=true
PC4.Signal=GPXTI4
PC7.Mode=Half_Duplex_Master
PC7.Signal=I2S2_CK
PD6.Mode=SAI_A_Master
PD6.Signal=SAI1_SD_A
PE10.Locked=true
PE10.Signal=GPXTI10
PE4.Mode=SAI_A_Master
PE4.Signal=SAI1_FS_A
PH0-OSC_IN.Mode=HSE-External-Oscillator
PH0-OSC_IN.Signal=RCC_OSC_IN
PH1-OSC_OUT.Mode=HSE-External-Oscillator
PH1-OSC_OUT.Signal=RCC_OSC_OUT
PinOutPanel.CurrentBGAView=Top
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=..\\..\\..\\..
ProjectManager.DefaultFWLocation=false
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32F446MEYx
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x13000
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=2
ProjectManager.MainLocation=Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=STM32F446ME-BlueCoin_ALLMEMS1.ioc
ProjectManager.ProjectName=STM32F446ME-BlueCoin_ALLMEMS1
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x5000
ProjectManager.TargetToolchain=EWARM V8.32
ProjectManager.ToolChainLocation=
ProjectManager.UnderRoot=false
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false,2-MX_GPIO_Init-GPIO-false-HAL-true,3-MX_CRC_Init-CRC-false-HAL-true,4-MX_I2S2_Init-I2S2-false-HAL-true,5-MX_SAI1_Init-SAI1-false-HAL-true,6-MX_TIM1_Init-TIM1-false-HAL-true,7-MX_TIM6_Init-TIM6-false-HAL-true,8-MX_TIM7_Init-TIM7-false-HAL-true,9-MX_IWDG_Init-IWDG-false-HAL-true,10-MX_ADC1_Init-ADC1-false-HAL-true,11-MX_TIM4_Init-TIM4-false-HAL-true
RCC.AHBFreq_Value=168000000
RCC.APB1CLKDivider=RCC_HCLK_DIV4
RCC.APB1Freq_Value=42000000
RCC.APB1TimFreq_Value=84000000
RCC.APB2CLKDivider=RCC_HCLK_DIV2
RCC.APB2Freq_Value=84000000
RCC.APB2TimFreq_Value=168000000
RCC.CECFreq_Value=32786.88524590164
RCC.CortexFreq_Value=168000000
RCC.FCLKCortexFreq_Value=168000000
RCC.FMPI2C1Freq_Value=42000000
RCC.FamilyName=M
RCC.HCLKFreq_Value=168000000
RCC.HSE_VALUE=16000000
RCC.I2S1Freq_Value=96000000
RCC.I2S2Freq_Value=96000000
RCC.IPParameters=AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CECFreq_Value,CortexFreq_Value,FCLKCortexFreq_Value,FMPI2C1Freq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,I2S1Freq_Value,I2S2Freq_Value,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLI2SPCLKFreq_Value,PLLI2SQCLKFreq_Value,PLLI2SRCLKFreq_Value,PLLI2SoutputFreq_Value,PLLN,PLLQ,PLLQCLKFreq_Value,PLLRCLKFreq_Value,PLLSAIPCLKFreq_Value,PLLSAIQCLKFreq_Value,PLLSAIoutputFreq_Value,PLLSourceVirtual,PWREXT_OverDrive,PWRFreq_Value,PWR_Regulator_Voltage_Scale,SAIAFreq_Value,SAIBFreq_Value,SDIOFreq_Value,SPDIFRXFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,USBFreq_Value,VCOI2SInputFreq_Value,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIInputFreq_Value,VCOSAIOutputFreq_Value
RCC.MCO2PinFreq_Value=168000000
RCC.PLLCLKFreq_Value=168000000
RCC.PLLI2SPCLKFreq_Value=96000000
RCC.PLLI2SQCLKFreq_Value=96000000
RCC.PLLI2SRCLKFreq_Value=96000000
RCC.PLLI2SoutputFreq_Value=96000000
RCC.PLLN=336
RCC.PLLQ=7
RCC.PLLQCLKFreq_Value=48000000
RCC.PLLRCLKFreq_Value=168000000
RCC.PLLSAIPCLKFreq_Value=96000000
RCC.PLLSAIQCLKFreq_Value=96000000
RCC.PLLSAIoutputFreq_Value=96000000
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
RCC.PWREXT_OverDrive=PWREXT_OverDrive_DESACTIVATED
RCC.PWRFreq_Value=168000000
RCC.PWR_Regulator_Voltage_Scale=PWR_REGULATOR_VOLTAGE_SCALE1
RCC.SAIAFreq_Value=96000000
RCC.SAIBFreq_Value=96000000
RCC.SDIOFreq_Value=48000000
RCC.SPDIFRXFreq_Value=168000000
RCC.SYSCLKFreq_VALUE=168000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLRCLK
RCC.USBFreq_Value=48000000
RCC.VCOI2SInputFreq_Value=1000000
RCC.VCOI2SOutputFreq_Value=192000000
RCC.VCOInputFreq_Value=1000000
RCC.VCOOutputFreq_Value=336000000
RCC.VCOSAIInputFreq_Value=1000000
RCC.VCOSAIOutputFreq_Value=192000000
SAI1.ErrorAudioFreq-SAI_A_Master=-2.34 %
SAI1.IPParameters=Instance-SAI_A_Master,VirtualMode-SAI_A_Master,MClockEnable-SAI_A_Master,RealAudioFreq-SAI_A_Master,ErrorAudioFreq-SAI_A_Master
SAI1.Instance-SAI_A_Master=SAI$Index_Block_A
SAI1.MClockEnable-SAI_A_Master=SAI_MASTERCLOCK_DISABLE
SAI1.RealAudioFreq-SAI_A_Master=187.5 KHz
SAI1.VirtualMode-SAI_A_Master=VM_MASTER
SH.ADCx_IN3.0=ADC1_IN3,IN3
SH.ADCx_IN3.ConfNb=1
SH.GPXTI0.0=GPIO_EXTI0
SH.GPXTI0.ConfNb=1
SH.GPXTI10.0=GPIO_EXTI10
SH.GPXTI10.ConfNb=1
SH.GPXTI4.0=GPIO_EXTI4
SH.GPXTI4.ConfNb=1
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_16
SPI1.CLKPolarity=SPI_POLARITY_LOW
SPI1.CalculateBaudRate=5.25 MBits/s
SPI1.Direction=SPI_DIRECTION_2LINES
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler,CLKPolarity
SPI1.Mode=SPI_MODE_MASTER
SPI1.VirtualType=VM_MASTER
STMicroelectronics.X-CUBE-BLE1.6.2.2.BSP.number=4
STMicroelectronics.X-CUBE-BLE1.6.2.2.BlueNRGAaMSCcWirelessJjBlueNRGAaMSJjController=true
STMicroelectronics.X-CUBE-BLE1.6.2.2.BlueNRGAaMSCcWirelessJjBlueNRGAaMSJjHCIIiTL=Basic
STMicroelectronics.X-CUBE-BLE1.6.2.2.BlueNRGAaMSCcWirelessJjBlueNRGAaMSJjHCIIiTLIiINTERFACE=UserBoard
STMicroelectronics.X-CUBE-BLE1.6.2.2.BlueNRGAaMSCcWirelessJjBlueNRGAaMSJjUtils=true
STMicroelectronics.X-CUBE-BLE1.6.2.2.IPParameters=BlueNRGAaMSCcWirelessJjBlueNRGAaMSJjController,BlueNRGAaMSCcWirelessJjBlueNRGAaMSJjUtils,BlueNRGAaMSCcWirelessJjBlueNRGAaMSJjHCIIiTL,BlueNRGAaMSCcWirelessJjBlueNRGAaMSJjHCIIiTLIiINTERFACE
STMicroelectronics.X-CUBE-BLE1.6.2.2.WirelessJjBlueNRGAaMS_Checked=true
STMicroelectronics.X-CUBE-BLE1.6.2.20.BSP.STBoard=false
STMicroelectronics.X-CUBE-BLE1.6.2.20.BSP.api=HAL_EXTI_DRIVER
STMicroelectronics.X-CUBE-BLE1.6.2.20.BSP.component=
STMicroelectronics.X-CUBE-BLE1.6.2.20.BSP.condition=SEMBlueNRGAaMSCcWirelessJjBlueNRGAaMSJjHCIIiTLIiINTERFACEJjUserBoard
STMicroelectronics.X-CUBE-BLE1.6.2.20.BSP.i2caddr=0
STMicroelectronics.X-CUBE-BLE1.6.2.20.BSP.i2creg=
STMicroelectronics.X-CUBE-BLE1.6.2.20.BSP.instance=PE10
STMicroelectronics.X-CUBE-BLE1.6.2.20.BSP.ip=GPIO
STMicroelectronics.X-CUBE-BLE1.6.2.20.BSP.mode=EXTI
STMicroelectronics.X-CUBE-BLE1.6.2.20.BSP.name=Exti Line
STMicroelectronics.X-CUBE-BLE1.6.2.20.BSP.semaphore=
STMicroelectronics.X-CUBE-BLE1.6.2.20.BSP.solution=PE10
STMicroelectronics.X-CUBE-BLE1.6.2.21.BSP.STBoard=false
STMicroelectronics.X-CUBE-BLE1.6.2.21.BSP.api=BSP_BUS_DRIVER
STMicroelectronics.X-CUBE-BLE1.6.2.21.BSP.component=
STMicroelectronics.X-CUBE-BLE1.6.2.21.BSP.condition=SEMBlueNRGAaMSCcWirelessJjBlueNRGAaMSJjHCIIiTLIiINTERFACEJjUserBoard
STMicroelectronics.X-CUBE-BLE1.6.2.21.BSP.i2caddr=0
STMicroelectronics.X-CUBE-BLE1.6.2.21.BSP.i2creg=
STMicroelectronics.X-CUBE-BLE1.6.2.21.BSP.instance=SPI1
STMicroelectronics.X-CUBE-BLE1.6.2.21.BSP.ip=SPI
STMicroelectronics.X-CUBE-BLE1.6.2.21.BSP.mode=Full-Duplex Master
STMicroelectronics.X-CUBE-BLE1.6.2.21.BSP.name=BUS IO driver
STMicroelectronics.X-CUBE-BLE1.6.2.21.BSP.semaphore=
STMicroelectronics.X-CUBE-BLE1.6.2.21.BSP.solution=SPI1
STMicroelectronics.X-CUBE-BLE1.6.2.22.BSP.STBoard=false
STMicroelectronics.X-CUBE-BLE1.6.2.22.BSP.api=Unknown
STMicroelectronics.X-CUBE-BLE1.6.2.22.BSP.component=
STMicroelectronics.X-CUBE-BLE1.6.2.22.BSP.condition=SEMBlueNRGAaMSCcWirelessJjBlueNRGAaMSJjHCIIiTLIiINTERFACEJjUserBoard
STMicroelectronics.X-CUBE-BLE1.6.2.22.BSP.i2caddr=0
STMicroelectronics.X-CUBE-BLE1.6.2.22.BSP.i2creg=
STMicroelectronics.X-CUBE-BLE1.6.2.22.BSP.instance=PA1
STMicroelectronics.X-CUBE-BLE1.6.2.22.BSP.ip=GPIO
STMicroelectronics.X-CUBE-BLE1.6.2.22.BSP.mode=Output
STMicroelectronics.X-CUBE-BLE1.6.2.22.BSP.name=CS Line
STMicroelectronics.X-CUBE-BLE1.6.2.22.BSP.semaphore=
STMicroelectronics.X-CUBE-BLE1.6.2.22.BSP.solution=PA1
STMicroelectronics.X-CUBE-BLE1.6.2.23.BSP.STBoard=false
STMicroelectronics.X-CUBE-BLE1.6.2.23.BSP.api=Unknown
STMicroelectronics.X-CUBE-BLE1.6.2.23.BSP.component=
STMicroelectronics.X-CUBE-BLE1.6.2.23.BSP.condition=SEMBlueNRGAaMSCcWirelessJjBlueNRGAaMSJjHCIIiTLIiINTERFACEJjUserBoard
STMicroelectronics.X-CUBE-BLE1.6.2.23.BSP.i2caddr=0
STMicroelectronics.X-CUBE-BLE1.6.2.23.BSP.i2creg=
STMicroelectronics.X-CUBE-BLE1.6.2.23.BSP.instance=PA2
STMicroelectronics.X-CUBE-BLE1.6.2.23.BSP.ip=GPIO
STMicroelectronics.X-CUBE-BLE1.6.2.23.BSP.mode=Output
STMicroelectronics.X-CUBE-BLE1.6.2.23.BSP.name=Reset Line
STMicroelectronics.X-CUBE-BLE1.6.2.23.BSP.semaphore=
STMicroelectronics.X-CUBE-BLE1.6.2.23.BSP.solution=PA2
STMicroelectronics.X-CUBE-BLE1.6.2.2_SwParameter=BlueNRGAaMSCcWirelessJjBlueNRGAaMSJjUtils\:true;BlueNRGAaMSCcWirelessJjBlueNRGAaMSJjHCIIiTL\:Basic;BlueNRGAaMSCcWirelessJjBlueNRGAaMSJjController\:true;BlueNRGAaMSCcWirelessJjBlueNRGAaMSJjHCIIiTLIiINTERFACE\:UserBoard;
STMicroelectronics.X-CUBE-MEMS1.9.1.0.BSP.number=2
STMicroelectronics.X-CUBE-MEMS1.9.1.0.BoardOoPartJjAccMagJjLSM303AGR=I2C
STMicroelectronics.X-CUBE-MEMS1.9.1.0.BoardOoPartJjAccMag_Checked=true
STMicroelectronics.X-CUBE-MEMS1.9.1.0.BoardOoPartJjPressTempJjLPS22HB=I2C
STMicroelectronics.X-CUBE-MEMS1.9.1.0.BoardOoPartJjPressTemp_Checked=true
STMicroelectronics.X-CUBE-MEMS1.9.1.0.IPParameters=BoardOoPartJjAccMagJjLSM303AGR,BoardOoPartJjPressTempJjLPS22HB
STMicroelectronics.X-CUBE-MEMS1.9.1.00.BSP.STBoard=false
STMicroelectronics.X-CUBE-MEMS1.9.1.00.BSP.api=BSP_BUS_DRIVER
STMicroelectronics.X-CUBE-MEMS1.9.1.00.BSP.component=
STMicroelectronics.X-CUBE-MEMS1.9.1.00.BSP.condition=SEMBoardOoPartJjAccMagJjLSM303AGRJjI2C
STMicroelectronics.X-CUBE-MEMS1.9.1.00.BSP.i2caddr=0
STMicroelectronics.X-CUBE-MEMS1.9.1.00.BSP.i2creg=
STMicroelectronics.X-CUBE-MEMS1.9.1.00.BSP.instance=I2C1
STMicroelectronics.X-CUBE-MEMS1.9.1.00.BSP.ip=I2C
STMicroelectronics.X-CUBE-MEMS1.9.1.00.BSP.mode=I2C
STMicroelectronics.X-CUBE-MEMS1.9.1.00.BSP.name=LSM303AGR BUS IO driver
STMicroelectronics.X-CUBE-MEMS1.9.1.00.BSP.semaphore=
STMicroelectronics.X-CUBE-MEMS1.9.1.00.BSP.solution=I2C1
STMicroelectronics.X-CUBE-MEMS1.9.1.01.BSP.STBoard=false
STMicroelectronics.X-CUBE-MEMS1.9.1.01.BSP.api=BSP_BUS_DRIVER
STMicroelectronics.X-CUBE-MEMS1.9.1.01.BSP.component=
STMicroelectronics.X-CUBE-MEMS1.9.1.01.BSP.condition=SEMBoardOoPartJjPressTempJjLPS22HBJjI2C
STMicroelectronics.X-CUBE-MEMS1.9.1.01.BSP.i2caddr=0
STMicroelectronics.X-CUBE-MEMS1.9.1.01.BSP.i2creg=
STMicroelectronics.X-CUBE-MEMS1.9.1.01.BSP.instance=I2C1
STMicroelectronics.X-CUBE-MEMS1.9.1.01.BSP.ip=I2C
STMicroelectronics.X-CUBE-MEMS1.9.1.01.BSP.mode=I2C
STMicroelectronics.X-CUBE-MEMS1.9.1.01.BSP.name=LPS22HB BUS IO driver
STMicroelectronics.X-CUBE-MEMS1.9.1.01.BSP.semaphore=
STMicroelectronics.X-CUBE-MEMS1.9.1.01.BSP.solution=I2C1
STMicroelectronics.X-CUBE-MEMS1.9.1.0_SwParameter=BoardOoPartJjPressTempJjLPS22HB\:I2C;BoardOoPartJjAccMagJjLSM303AGR\:I2C;
TIM1.Channel-Output\ Compare1\ No\ Output=TIM_CHANNEL_1
TIM1.Channel-Output\ Compare3\ No\ Output=TIM_CHANNEL_3
TIM1.Channel-Output\ Compare4\ No\ Output=TIM_CHANNEL_4
TIM1.IPParameters=Channel-Output Compare1 No Output,Channel-Output Compare3 No Output,Channel-Output Compare4 No Output,Prescaler,OCMode_1,OCMode_3,OCMode_4,Pulse-Output Compare1 No Output,Pulse-Output Compare3 No Output,Pulse-Output Compare4 No Output,OCPolarity_1,OCPolarity_3,OCPolarity_4
TIM1.IPParametersWithoutCheck=Pulse-Output Compare4 No Output,Prescaler,Pulse-Output Compare1 No Output,Pulse-Output Compare3 No Output
TIM1.OCMode_1=TIM_OCMODE_TOGGLE
TIM1.OCMode_3=TIM_OCMODE_TOGGLE
TIM1.OCMode_4=TIM_OCMODE_TOGGLE
TIM1.OCPolarity_1=TIM_OCPOLARITY_LOW
TIM1.OCPolarity_3=TIM_OCPOLARITY_LOW
TIM1.OCPolarity_4=TIM_OCPOLARITY_LOW
TIM1.Prescaler=((SystemCoreClock / 10000) - 1)
TIM1.Pulse-Output\ Compare1\ No\ Output=DEFAULT_uhCCR1_Val
TIM1.Pulse-Output\ Compare3\ No\ Output=DEFAULT_uhCCR3_Val
TIM1.Pulse-Output\ Compare4\ No\ Output=DEFAULT_uhCCR4_Val
TIM4.IPParameters=Period,Prescaler
TIM4.IPParametersWithoutCheck=Prescaler,Period
TIM4.Period=((TIM_CLOCK_ENV/ALGO_FREQ_ENV)-1)
TIM4.Prescaler=(((SystemCoreClock/2)/TIM_CLOCK_ENV)-1)
TIM6.IPParameters=Prescaler,Period
TIM6.IPParametersWithoutCheck=Prescaler,Period
TIM6.Period=((TIM_CLOCK_AUDIO_LEVEL  / ALGO_FREQ_AUDIO_LEVEL) -1)
TIM6.Prescaler=(((SystemCoreClock / 2) / TIM_CLOCK_AUDIO_LEVEL) - 1)
TIM7.IPParameters=Prescaler,Period
TIM7.IPParametersWithoutCheck=Prescaler
TIM7.Period=400
TIM7.Prescaler=(((SystemCoreClock/ 2) / 10000) - 1)
VP_CRC_VS_CRC.Mode=CRC_Activate
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
VP_IWDG_VS_IWDG.Mode=IWDG_Activate
VP_IWDG_VS_IWDG.Signal=IWDG_VS_IWDG
VP_STMicroelectronics.X-CUBE-BLE1_VS_WirelessJjBlueNRGAaMS_6.2.2.Mode=WirelessJjBlueNRGAaMS
VP_STMicroelectronics.X-CUBE-BLE1_VS_WirelessJjBlueNRGAaMS_6.2.2.Signal=STMicroelectronics.X-CUBE-BLE1_VS_WirelessJjBlueNRGAaMS_6.2.2
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjAccMag_5.4.1_9.1.0.Mode=BoardOoPartJjAccMag
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjAccMag_5.4.1_9.1.0.Signal=STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjAccMag_5.4.1_9.1.0
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjPressTemp_5.3.1_9.1.0.Mode=BoardOoPartJjPressTemp
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjPressTemp_5.3.1_9.1.0.Signal=STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoPartJjPressTemp_5.3.1_9.1.0
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TIM1_VS_no_output1.Mode=Output Compare1 No Output
VP_TIM1_VS_no_output1.Signal=TIM1_VS_no_output1
VP_TIM1_VS_no_output3.Mode=Output Compare3 No Output
VP_TIM1_VS_no_output3.Signal=TIM1_VS_no_output3
VP_TIM1_VS_no_output4.Mode=Output Compare4 No Output
VP_TIM1_VS_no_output4.Signal=TIM1_VS_no_output4
VP_TIM4_VS_ClockSourceINT.Mode=Internal
VP_TIM4_VS_ClockSourceINT.Signal=TIM4_VS_ClockSourceINT
VP_TIM6_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM6_VS_ClockSourceINT.Signal=TIM6_VS_ClockSourceINT
VP_TIM7_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM7_VS_ClockSourceINT.Signal=TIM7_VS_ClockSourceINT
board=custom
